app/views/users/show.html.erb


<p> <% @user.packages.each do |package|%></p>
---
SELECT "packages".* FROM "packages" WHERE "packages"."user_id" = ?  [["user_id", 1]]