app/controllers/admins_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", 2]]
---
  def find_admin
    @admin = Admin.find(params[:id])