app/controllers/assignments_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "packages".* FROM "packages" WHERE "packages"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "assignments" ("package_id", "admin_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["package_id", 1], ["admin_id", 3], ["created_at", "2015-11-23 08:38:28.860478"], ["updated_at", "2015-11-23 08:38:28.860478"]]
---
  def create
    @admin = Admin.find(3)
    package = Package.find(params[:package_id])
  	@assignment = @admin.assignments.build(package_id: package.id)
      if @assignment.save