app/controllers/couriers_controller.rb

	def create
		@courier = Courier.new(courier_param)
		if @courier.save
---
INSERT INTO "couriers" ("name", "address", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "fghfs"], ["address", "ywgfdwg"], ["phone", "hgwghd"], ["created_at", "2015-11-16 11:13:52.995641"], ["updated_at", "2015-11-16 11:13:52.995641"]]

	def update
		if @courier.update(courier_param)
---
UPDATE "couriers" SET "name" = ?, "address" = ?, "phone" = ?, "updated_at" = ? WHERE "couriers"."id" = ?  [["name", "Henry"], ["address", "Ghana"], ["phone", "0234567435"], ["updated_at", "2015-11-16 13:33:17.927375"], ["id", 1]]

	def index
		@couriers = Courier.all
---
SELECT "couriers".* FROM "couriers"

		def find_courier
			@courier = Courier.find(params[:id])
---
SELECT  "couriers".* FROM "couriers" WHERE "couriers"."id" = ? LIMIT 1  [["id", 1]]