app/controllers/packages_controller.rb

  def index
  	@packages = Package.all
---
SELECT "packages".* FROM "packages"

  def new
  @package = Package.new
  @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]

 	def find_package
  		@package = Package.find(params[:id])
---
SELECT  "packages".* FROM "packages" WHERE "packages"."id" = ? LIMIT 1  [["id", 6]]