app/controllers/users_controller.rb

INSERT INTO "users" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["address", ""], ["created_at", "2015-11-19 15:36:35.081963"], ["updated_at", "2015-11-19 15:36:35.081963"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save